<?php
// +----------------------------------------------------------------------
// | Api Code
// +----------------------------------------------------------------------
return [
    //系统级错误
    0   => '系统自定义信息',
    100 => '参数有误',
    101 => '数据查询失败',
    102 => '数据解析失败',
    103 => '数据存储异常',
    104 => '未知的数据来源',
    105 => '非法的请求',
    106 => '数据解密失败',
    107 => '接口不存在',
    110 => '数据加密失败',
    111 => '网络异常，请稍后重试',
    112 => '失败次数过多,请联系厂家',
    113 => '请求频繁,请稍后再试!',

    //成功
    200 => '成功',

    //用户登陆模块
    201 => '用户凭心已失效,请重新登陆',

    //微信接口调用模块
    300 => 'open_id 获取异常',
    301 => '手机号解析异常',

    //用户模块
    400 => '登陆异常,请稍后重试',

    //获取位置模块
    500 => '中心点坐标获取异常',
    501 => '非法的出行方式'
];