<?php


// +----------------------------------------------------------------------
// | Wechat (微信)
// +----------------------------------------------------------------------


return [
    //公众号
    'gzh'   => [
        //app_id
        'app_id' => 'wxef3dd2fc9096960e',
        //app_secret
        'app_secret' => 'e1ad81674b8416e34926b7b1455f2670'
    ],

    //小程序
    'xcx'   => [
        //appid
        'app_id' => 'wxf03d6b48d0749cc7',
        //app_secret
        'app_secret' => '817cd0388bbaa505a686c90f8d2c6dbd'
    ],

];